# ViewId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewExportingEventArgs..::..ViewId Property
ViewExportingEventArgs Class See Also
---
Identifies the view about to be exported.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ElementId ViewId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
```

# See Also
ViewExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace